{
  "timeline": [
    {
      "year": "1984",
      "desc": "Born in White Plains, New York, the only son of a dentist and psychiatrist (he has three sisters)."
    },
    {
      "year": "2002",
      "desc": "Graduates from Phillips Exeter Academy, a private school in New Hampshire; joins Harvard University in autumn on a psychology and computer science course."
    },
    {
      "year": "2003",
      "desc": "Launches Facemash - a web programme enabling Harvard students to compare images of same-gender students and rate the more attractive - and nearly gets kicked out when its immediate popularity draws the attention of the university administrators."
    },
    {
      "year": "2004",
      "desc": "Starts Thefacebook.com in February."
    },
    {
      "year": "2004",
      "desc": "Drops out of Harvard at the end of his sophomore year; moves to Palo Alto that summer, where he rents a house with a now-famous swimming pool (and zip-wire)."
    },
    {
      "year": "2004",
      "desc": "Facebook hits 200,000 users; contacts venture capitalists in Silicon Valley, and receives an initial investment of half a million dollars - some of which is used to splash out on a small office above a Chinese restaurant"
    },
    {
      "year": "2004",
      "desc": "The Winklevoss twins file a lawsuit against Zuckerberg claiming he ripped off their idea for a new social network, HarvardConnection (later ConnectU)."
    },
    {
      "year": "2005",
      "desc": "Facebook hits 5 million users."
    },
    {
      "year": "2006",
      "desc": "At 22 years of age, Zuckerberg turns down an estimated $1 billion dollar offer for Facebook from Yahoo."
    },
    {
      "year": "2007",
      "desc": "Opens Facebook beyond universities so anyone with an email address can join; turns down a $15 billion offer from Microsoft, which would have bagged him personally $4 billion."
    },
    {
      "year": "2008",
      "desc": "Reaches a settlement with Winklevoss lawsuit worth $65 million, though still denies any intellectual property theft."
    },
    {
      "year": "2009",
      "desc": "China blocks domestic access to Facebook."
    },
    {
      "year": "2010",
      "desc": "Hollywood movie The Social Network is released documenting Zuckerberg's time at Harvard and the early days of Facebook."
    },
    {
      "year": "2011",
      "desc": "Appears on Saturday Night Live along with host Jesse Eisenberg, who played him in the film."
    },
    {
      "year": "2011",
      "desc": "Facebook records half a billion users on Facebook in a single day, and is expected to report $4 billion dollars revenue, double that of the previous year."
    },
    {
      "year": "2012",
      "desc": "Facebook projected to reach 1 billion users; a much-mooted stock market flotation would be expected to earn as much as $100 billion."
    }
  ]
}
